wjk5117/BMM350-I3C-ESP32P4-Bringup/bmm350_defs.h
/**
* Copyright (c) 2023 Bosch Sensortec GmbH. All rights reserved.
*
* BSD-3-Clause
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1. Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
* 2. Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
* 3. Neither the name of the copyright holder nor the names of its
*    contributors may be used to endorse or promote products derived from
*    this software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
* "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
* LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
* FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
* COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
* IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
* @file       bmm350_defs.h
* @date       2023-05-26
* @version    v1.4.0
*
*/

#ifndef _BMM350_DEFS_H
#define _BMM350_DEFS_H

/*************************** Header files *******************************/

#ifdef __KERNEL__
#include <linux/types.h>
#include <linux/kernel.h>
#else
#include <stdint.h>
#include <stddef.h>
#endif

/***************************** Common Macros *****************************/

#ifdef __KERNEL__
#if !defined(UINT8_C) && !defined(INT8_C)
#define INT8_C(x)    S8_C(x)
#define UINT8_C(x)   U8_C(x)
#endif

#if !defined(UINT16_C) && !defined(INT16_C)
#define INT16_C(x)   S16_C(x)
#define UINT16_C(x)  U16_C(x)
#endif

#if !defined(INT32_C) && !defined(UINT32_C)
#define INT32_C(x)   S32_C(x)
#define UINT32_C(x)  U32_C(x)
#endif

#if !defined(INT64_C) && !defined(UINT64_C)
#define INT64_C(x)   S64_C(x)
#define UINT64_C(x)  U64_C(x)
#endif
#endif

/*! C standard macros */
#ifndef NULL
#ifdef __cplusplus
#define NULL         0
#else
#define NULL         ((void *) 0)
#endif
#endif

/******************************************************************************/
/*! @name        Compiler switch macros Definitions                           */
/******************************************************************************/

/************************* General Macro definitions ***************************/

/* Macro to SET and GET BITS of a register*/
#define BMM350_SET_BITS(reg_data, bitname, data) \
    ((reg_data & ~(bitname##_MSK)) | \
     ((data << bitname##_POS) & bitname##_MSK))

#define BMM350_GET_BITS(reg_data, bitname)          ((reg_data & (bitname##_MSK)) >> (bitname##_POS))

#define BMM350_GET_BITS_POS_0(reg_data, bitname)    (reg_data & (bitname##_MSK))

#define BMM350_SET_BITS_POS_0(reg_data, bitname, data) \
    ((reg_data & ~(bitname##_MSK)) | \
     (data & bitname##_MSK))

#ifndef BMM350_INTF_RET_TYPE
#define BMM350_INTF_RET_TYPE                        int8_t
#endif

#define UNUSED(x) (void)(x)

/*! Chip id of BMM350 */
#define BMM350_CHIP_ID                              UINT8_C(0x33)

/*! Variant ID of BMM350 */
#define BMM350_MIN_VAR                              UINT8_C(0x10)

/************************* Sensor interface success code **************************/
#define BMM350_INTF_RET_SUCCESS                     INT8_C(0)

/************************* API success code **************************/
#define BMM350_OK                                   INT8_C(0)

/* API error codes */
#define BMM350_E_NULL_PTR                           INT8_C(-1)
#define BMM350_E_COM_FAIL                           INT8_C(-2)
#define BMM350_E_DEV_NOT_FOUND                      INT8_C(-3)
#define BMM350_E_INVALID_CONFIG                     INT8_C(-4)
#define BMM350_E_BAD_PAD_DRIVE                      INT8_C(-5)
#define BMM350_E_RESET_UNFINISHED                   INT8_C(-6)
#define BMM350_E_INVALID_INPUT                      INT8_C(-7)
#define BMM350_E_SELF_TEST_INVALID_AXIS             INT8_C(-8)
#define BMM350_E_OTP_BOOT                           INT8_C(-9)
#define BMM350_E_OTP_PAGE_RD                        INT8_C(-10)
#define BMM350_E_OTP_PAGE_PRG                       INT8_C(-11)
#define BMM350_E_OTP_SIGN                           INT8_C(-12)
#define BMM350_E_OTP_INV_CMD                        INT8_C(-13)
#define BMM350_E_OTP_UNDEFINED                      INT8_C(-14)
#define BMM350_E_ALL_AXIS_DISABLED                  INT8_C(-15)
#define BMM350_E_PMU_CMD_VALUE                      INT8_C(-16)

#define BMM350_NO_ERROR                             UINT8_C(0)

/************************* Sensor delay time settings in microseconds **************************/
#define BMM350_SOFT_RESET_DELAY                     UINT32_C(24000)
#define BMM350_MAGNETIC_RESET_DELAY                 UINT32_C(40000)
#define BMM350_START_UP_TIME_FROM_POR               UINT32_C(3000)

#define BMM350_GOTO_SUSPEND_DELAY                   UINT32_C(6000)
#define BMM350_SUSPEND_TO_NORMAL_DELAY              UINT32_C(38000)

#define BMM350_SUS_TO_FORCEDMODE_NO_AVG_DELAY       UINT32_C(15000)
#define BMM350_SUS_TO_FORCEDMODE_AVG_2_DELAY        UINT32_C(17000)
#define BMM350_SUS_TO_FORCEDMODE_AVG_4_DELAY        UINT32_C(20000)
#define BMM350_SUS_TO_FORCEDMODE_AVG_8_DELAY        UINT32_C(28000)

#define BMM350_SUS_TO_FORCEDMODE_FAST_NO_AVG_DELAY  UINT32_C(4000)
#define BMM350_SUS_TO_FORCEDMODE_FAST_AVG_2_DELAY   UINT32_C(5000)
#define BMM350_SUS_TO_FORCEDMODE_FAST_AVG_4_DELAY   UINT32_C(9000)
#define BMM350_SUS_TO_FORCEDMODE_FAST_AVG_8_DELAY   UINT32_C(16000)

#define BMM350_UPD_OAE_DELAY                        UINT16_C(1000)

#define BMM350_BR_DELAY                             UINT16_C(14000)
#define BMM350_FGR_DELAY                            UINT16_C(18000)

/************************ Length macros ************************/
#define BMM350_OTP_DATA_LENGTH                      UINT8_C(32)
#define BMM350_READ_BUFFER_LENGTH                   UINT8_C(127)
#define BMM350_MAG_TEMP_DATA_LEN                    UINT8_C(12)

/************************ Averaging macros **********************/
#define BMM350_AVG_NO_AVG                           UINT8_C(0x0)
#define BMM350_AVG_2                                UINT8_C(0x1)
#define BMM350_AVG_4                                UINT8_C(0x2)
#define BMM350_AVG_8                                UINT8_C(0x3)

