wjk5117/BMM350-I3C-ESP32P4-Bringup/bmm350_defs.h
/******************************* ODR **************************/
#define BMM350_ODR_400HZ                            UINT8_C(0x2)
#define BMM350_ODR_200HZ                            UINT8_C(0x3)
#define BMM350_ODR_100HZ                            UINT8_C(0x4)
#define BMM350_ODR_50HZ                             UINT8_C(0x5)
#define BMM350_ODR_25HZ                             UINT8_C(0x6)
#define BMM350_ODR_12_5HZ                           UINT8_C(0x7)
#define BMM350_ODR_6_25HZ                           UINT8_C(0x8)
#define BMM350_ODR_3_125HZ                          UINT8_C(0x9)
#define BMM350_ODR_1_5625HZ                         UINT8_C(0xA)

/********************* Power modes *************************/
#define BMM350_PMU_CMD_SUS                          UINT8_C(0x00)
#define BMM350_PMU_CMD_NM                           UINT8_C(0x01)
#define BMM350_PMU_CMD_UPD_OAE                      UINT8_C(0x02)
#define BMM350_PMU_CMD_FM                           UINT8_C(0x03)
#define BMM350_PMU_CMD_FM_FAST                      UINT8_C(0x04)
#define BMM350_PMU_CMD_FGR                          UINT8_C(0x05)
#define BMM350_PMU_CMD_FGR_FAST                     UINT8_C(0x06)
#define BMM350_PMU_CMD_BR                           UINT8_C(0x07)
#define BMM350_PMU_CMD_BR_FAST                      UINT8_C(0x08)
#define BMM350_PMU_CMD_NM_TC                        UINT8_C(0x09)

#define BMM350_PMU_STATUS_0                         UINT8_C(0x0)

#define BMM350_DISABLE                              UINT8_C(0x0)
#define BMM350_ENABLE                               UINT8_C(0x1)

#define BMM350_CMD_NOP                              UINT8_C(0x0)
#define BMM350_CMD_SOFTRESET                        UINT8_C(0xB6)

#define BMM350_TARGET_PAGE_PAGE0                    UINT8_C(0x0)
#define BMM350_TARGET_PAGE_PAGE1                    UINT8_C(0x1)

#define BMM350_INT_MODE_LATCHED                     UINT8_C(0x1)
#define BMM350_INT_MODE_PULSED                      UINT8_C(0x0)

#define BMM350_INT_POL_ACTIVE_HIGH                  UINT8_C(0x1)
#define BMM350_INT_POL_ACTIVE_LOW                   UINT8_C(0x0)

#define BMM350_INT_OD_PUSHPULL                      UINT8_C(0x1)
#define BMM350_INT_OD_OPENDRAIN                     UINT8_C(0x0)

#define BMM350_INT_OUTPUT_EN_OFF                    UINT8_C(0x0)
#define BMM350_INT_OUTPUT_EN_ON                     UINT8_C(0x1)

#define BMM350_INT_DRDY_EN                          UINT8_C(0x1)
#define BMM350_INT_DRDY_DIS                         UINT8_C(0x0)

#define BMM350_MR_MR1K8                             UINT8_C(0x0)
#define BMM350_MR_MR2K1                             UINT8_C(0x1)
#define BMM350_MR_MR1K5                             UINT8_C(0x2)
#define BMM350_MR_MR0K6                             UINT8_C(0x3)

#define BMM350_SEL_DTB1X_PAD_PAD_INT                UINT8_C(0x0)
#define BMM350_SEL_DTB1X_PAD_PAD_BYP                UINT8_C(0x1)

#define BMM350_TMR_TST_HIZ_VTMR_VTMR_ON             UINT8_C(0x0)
#define BMM350_TMR_TST_HIZ_VTMR_VTMR_HIZ            UINT8_C(0x1)

#define BMM350_LSB_MASK                             UINT16_C(0x00FF)
#define BMM350_MSB_MASK                             UINT16_C(0xFF00)

/********************** Pad drive strength ************************/
#define BMM350_PAD_DRIVE_WEAKEST                    UINT8_C(0)
#define BMM350_PAD_DRIVE_STRONGEST                  UINT8_C(7)

/********************** I2C Register Addresses ************************/

/*! Register to set I2C address to LOW */
#define BMM350_I2C_ADSEL_SET_LOW                    UINT8_C(0x14)

/*! Register to set I2C address to HIGH */
#define BMM350_I2C_ADSEL_SET_HIGH                   UINT8_C(0x15)

#define BMM350_DUMMY_BYTES                          UINT8_C(2)

/********************** Register Addresses ************************/

#define BMM350_REG_CHIP_ID                          UINT8_C(0x00)
#define BMM350_REG_REV_ID                           UINT8_C(0x01)
#define BMM350_REG_ERR_REG                          UINT8_C(0x02)
#define BMM350_REG_PAD_CTRL                         UINT8_C(0x03)
#define BMM350_REG_PMU_CMD_AGGR_SET                 UINT8_C(0x04)
#define BMM350_REG_PMU_CMD_AXIS_EN                  UINT8_C(0x05)
#define BMM350_REG_PMU_CMD                          UINT8_C(0x06)
#define BMM350_REG_PMU_CMD_STATUS_0                 UINT8_C(0x07)
#define BMM350_REG_PMU_CMD_STATUS_1                 UINT8_C(0x08)
#define BMM350_REG_I3C_ERR                          UINT8_C(0x09)
#define BMM350_REG_I2C_WDT_SET                      UINT8_C(0x0A)
#define BMM350_REG_TRSDCR_REV_ID                    UINT8_C(0x0D)
#define BMM350_REG_TC_SYNC_TU                       UINT8_C(0x21)
#define BMM350_REG_TC_SYNC_ODR                      UINT8_C(0x22)
#define BMM350_REG_TC_SYNC_TPH_1                    UINT8_C(0x23)
#define BMM350_REG_TC_SYNC_TPH_2                    UINT8_C(0x24)
#define BMM350_REG_TC_SYNC_DT                       UINT8_C(0x25)
#define BMM350_REG_TC_SYNC_ST_0                     UINT8_C(0x26)
#define BMM350_REG_TC_SYNC_ST_1                     UINT8_C(0x27)
#define BMM350_REG_TC_SYNC_ST_2                     UINT8_C(0x28)
#define BMM350_REG_TC_SYNC_STATUS                   UINT8_C(0x29)
#define BMM350_REG_INT_CTRL                         UINT8_C(0x2E)
#define BMM350_REG_INT_CTRL_IBI                     UINT8_C(0x2F)
#define BMM350_REG_INT_STATUS                       UINT8_C(0x30)
#define BMM350_REG_MAG_X_XLSB                       UINT8_C(0x31)
#define BMM350_REG_MAG_X_LSB                        UINT8_C(0x32)
#define BMM350_REG_MAG_X_MSB                        UINT8_C(0x33)
#define BMM350_REG_MAG_Y_XLSB                       UINT8_C(0x34)
#define BMM350_REG_MAG_Y_LSB                        UINT8_C(0x35)
#define BMM350_REG_MAG_Y_MSB                        UINT8_C(0x36)
#define BMM350_REG_MAG_Z_XLSB                       UINT8_C(0x37)
#define BMM350_REG_MAG_Z_LSB                        UINT8_C(0x38)
#define BMM350_REG_MAG_Z_MSB                        UINT8_C(0x39)
#define BMM350_REG_TEMP_XLSB                        UINT8_C(0x3A)
#define BMM350_REG_TEMP_LSB                         UINT8_C(0x3B)
#define BMM350_REG_TEMP_MSB                         UINT8_C(0x3C)
#define BMM350_REG_SENSORTIME_XLSB                  UINT8_C(0x3D)
#define BMM350_REG_SENSORTIME_LSB                   UINT8_C(0x3E)
#define BMM350_REG_SENSORTIME_MSB                   UINT8_C(0x3F)
#define BMM350_REG_OTP_CMD_REG                      UINT8_C(0x50)
#define BMM350_REG_OTP_DATA_MSB_REG                 UINT8_C(0x52)
#define BMM350_REG_OTP_DATA_LSB_REG                 UINT8_C(0x53)
#define BMM350_REG_OTP_STATUS_REG                   UINT8_C(0x55)
#define BMM350_REG_TMR_SELFTEST_USER                UINT8_C(0x60)
#define BMM350_REG_CTRL_USER                        UINT8_C(0x61)
#define BMM350_REG_CMD                              UINT8_C(0x7E)

/*********************** Macros for OVWR ***************************/
#define BMM350_REG_OVWR_VALUE_ANA_0                 UINT8_C(0x3A)
#define BMM350_REG_OVWR_EN_ANA_0                    UINT8_C(0x3B)

/*********************** Macros for bit masking ***************************/

