wjk5117/BMM350-I3C-ESP32P4-Bringup/bmm350_defs.h
#define BMM350_CHIP_ID_OTP_MSK                      UINT8_C(0xf)
#define BMM350_CHIP_ID_OTP_POS                      UINT8_C(0x0)
#define BMM350_CHIP_ID_FIXED_MSK                    UINT8_C(0xf0)
#define BMM350_CHIP_ID_FIXED_POS                    UINT8_C(0x4)
#define BMM350_REV_ID_MAJOR_MSK                     UINT8_C(0xf0)
#define BMM350_REV_ID_MAJOR_POS                     UINT8_C(0x4)
#define BMM350_REV_ID_MINOR_MSK                     UINT8_C(0xf)
#define BMM350_REV_ID_MINOR_POS                     UINT8_C(0x0)
#define BMM350_PMU_CMD_ERROR_MSK                    UINT8_C(0x1)
#define BMM350_PMU_CMD_ERROR_POS                    UINT8_C(0x0)
#define BMM350_BOOT_UP_ERROR_MSK                    UINT8_C(0x2)
#define BMM350_BOOT_UP_ERROR_POS                    UINT8_C(0x1)
#define BMM350_DRV_MSK                              UINT8_C(0x7)
#define BMM350_DRV_POS                              UINT8_C(0x0)
#define BMM350_AVG_MSK                              UINT8_C(0x30)
#define BMM350_AVG_POS                              UINT8_C(0x4)
#define BMM350_ODR_MSK                              UINT8_C(0xf)
#define BMM350_ODR_POS                              UINT8_C(0x0)
#define BMM350_PMU_CMD_MSK                          UINT8_C(0xf)
#define BMM350_PMU_CMD_POS                          UINT8_C(0x0)
#define BMM350_EN_X_MSK                             UINT8_C(0x01)
#define BMM350_EN_X_POS                             UINT8_C(0x0)
#define BMM350_EN_Y_MSK                             UINT8_C(0x02)
#define BMM350_EN_Y_POS                             UINT8_C(0x1)
#define BMM350_EN_Z_MSK                             UINT8_C(0x04)
#define BMM350_EN_Z_POS                             UINT8_C(0x2)
#define BMM350_EN_XYZ_MSK                           UINT8_C(0x7)
#define BMM350_EN_XYZ_POS                           UINT8_C(0x0)
#define BMM350_PMU_CMD_BUSY_MSK                     UINT8_C(0x1)
#define BMM350_PMU_CMD_BUSY_POS                     UINT8_C(0x0)
#define BMM350_ODR_OVWR_MSK                         UINT8_C(0x2)
#define BMM350_ODR_OVWR_POS                         UINT8_C(0x1)
#define BMM350_AVG_OVWR_MSK                         UINT8_C(0x4)
#define BMM350_AVG_OVWR_POS                         UINT8_C(0x2)
#define BMM350_PWR_MODE_IS_NORMAL_MSK               UINT8_C(0x8)
#define BMM350_PWR_MODE_IS_NORMAL_POS               UINT8_C(0x3)
#define BMM350_CMD_IS_ILLEGAL_MSK                   UINT8_C(0x10)
#define BMM350_CMD_IS_ILLEGAL_POS                   UINT8_C(0x4)
#define BMM350_PMU_CMD_VALUE_MSK                    UINT8_C(0xE0)
#define BMM350_PMU_CMD_VALUE_POS                    UINT8_C(0x5)
#define BMM350_PMU_ODR_S_MSK                        UINT8_C(0xf)
#define BMM350_PMU_ODR_S_POS                        UINT8_C(0x0)
#define BMM350_PMU_AVG_S_MSK                        UINT8_C(0x30)
#define BMM350_PMU_AVG_S_POS                        UINT8_C(0x4)
#define BMM350_I3C_ERROR_0_MSK                      UINT8_C(0x1)
#define BMM350_I3C_ERROR_0_POS                      UINT8_C(0x0)
#define BMM350_I3C_ERROR_3_MSK                      UINT8_C(0x8)
#define BMM350_I3C_ERROR_3_POS                      UINT8_C(0x3)
#define BMM350_I2C_WDT_EN_MSK                       UINT8_C(0x1)
#define BMM350_I2C_WDT_EN_POS                       UINT8_C(0x0)
#define BMM350_I2C_WDT_SEL_MSK                      UINT8_C(0x2)
#define BMM350_I2C_WDT_SEL_POS                      UINT8_C(0x1)
#define BMM350_TRSDCR_REV_ID_OTP_MSK                UINT8_C(0x3)
#define BMM350_TRSDCR_REV_ID_OTP_POS                UINT8_C(0x0)
#define BMM350_TRSDCR_REV_ID_FIXED_MSK              UINT8_C(0xfc)
#define BMM350_TRSDCR_REV_ID_FIXED_POS              UINT8_C(0x2)
#define BMM350_PAGING_EN_MSK                        UINT8_C(0x80)
#define BMM350_PAGING_EN_POS                        UINT8_C(0x7)
#define BMM350_DRDY_DATA_REG_MSK                    UINT8_C(0x4)
#define BMM350_DRDY_DATA_REG_POS                    UINT8_C(0x2)
#define BMM350_INT_MODE_MSK                         UINT8_C(0x1)
#define BMM350_INT_MODE_POS                         UINT8_C(0x0)
#define BMM350_INT_POL_MSK                          UINT8_C(0x2)
#define BMM350_INT_POL_POS                          UINT8_C(0x1)
#define BMM350_INT_OD_MSK                           UINT8_C(0x4)
#define BMM350_INT_OD_POS                           UINT8_C(0x2)
#define BMM350_INT_OUTPUT_EN_MSK                    UINT8_C(0x8)
#define BMM350_INT_OUTPUT_EN_POS                    UINT8_C(0x3)
#define BMM350_DRDY_DATA_REG_EN_MSK                 UINT8_C(0x80)
#define BMM350_DRDY_DATA_REG_EN_POS                 UINT8_C(0x7)
#define BMM350_DRDY_INT_MAP_TO_IBI_MSK              UINT8_C(0x1)
#define BMM350_DRDY_INT_MAP_TO_IBI_POS              UINT8_C(0x0)
#define BMM350_CLEAR_DRDY_INT_STATUS_UPON_IBI_MSK   UINT8_C(0x10)
#define BMM350_CLEAR_DRDY_INT_STATUS_UPON_IBI_POS   UINT8_C(0x4)
#define BMM350_TC_SYNC_TU_MSK                       UINT8_C(0xff)
#define BMM350_TC_SYNC_ODR_MSK                      UINT8_C(0xff)
#define BMM350_TC_SYNC_TPH_1_MSK                    UINT8_C(0xff)
#define BMM350_TC_SYNC_TPH_2_MSK                    UINT8_C(0xff)
#define BMM350_TC_SYNC_DT_MSK                       UINT8_C(0xff)
#define BMM350_TC_SYNC_ST_0_MSK                     UINT8_C(0xff)
#define BMM350_TC_SYNC_ST_1_MSK                     UINT8_C(0xff)
#define BMM350_TC_SYNC_ST_2_MSK                     UINT8_C(0xff)
#define BMM350_CFG_FORCE_SOSC_EN_MSK                UINT8_C(0x4)
#define BMM350_CFG_FORCE_SOSC_EN_POS                UINT8_C(0x2)
#define BMM350_ST_IGEN_EN_MSK                       UINT8_C(0x1)
#define BMM350_ST_IGEN_EN_POS                       UINT8_C(0x0)
#define BMM350_ST_N_MSK                             UINT8_C(0x2)
#define BMM350_ST_N_POS                             UINT8_C(0x1)
#define BMM350_ST_P_MSK                             UINT8_C(0x4)
#define BMM350_ST_P_POS                             UINT8_C(0x2)
#define BMM350_IST_EN_X_MSK                         UINT8_C(0x8)
#define BMM350_IST_EN_X_POS                         UINT8_C(0x3)
#define BMM350_IST_EN_Y_MSK                         UINT8_C(0x10)
#define BMM350_IST_EN_Y_POS                         UINT8_C(0x4)
#define BMM350_CFG_SENS_TIM_AON_MSK                 UINT8_C(0x1)
#define BMM350_CFG_SENS_TIM_AON_POS                 UINT8_C(0x0)
#define BMM350_DATA_X_7_0_MSK                       UINT8_C(0xff)
#define BMM350_DATA_X_7_0_POS                       UINT8_C(0x0)
#define BMM350_DATA_X_15_8_MSK                      UINT8_C(0xff)
#define BMM350_DATA_X_15_8_POS                      UINT8_C(0x0)
#define BMM350_DATA_X_23_16_MSK                     UINT8_C(0xff)
#define BMM350_DATA_X_23_16_POS                     UINT8_C(0x0)
#define BMM350_DATA_Y_7_0_MSK                       UINT8_C(0xff)
#define BMM350_DATA_Y_7_0_POS                       UINT8_C(0x0)
#define BMM350_DATA_Y_15_8_MSK                      UINT8_C(0xff)
#define BMM350_DATA_Y_15_8_POS                      UINT8_C(0x0)
#define BMM350_DATA_Y_23_16_MSK                     UINT8_C(0xff)
#define BMM350_DATA_Y_23_16_POS                     UINT8_C(0x0)
#define BMM350_DATA_Z_7_0_MSK                       UINT8_C(0xff)
#define BMM350_DATA_Z_7_0_POS                       UINT8_C(0x0)
#define BMM350_DATA_Z_15_8_MSK                      UINT8_C(0xff)
#define BMM350_DATA_Z_15_8_POS                      UINT8_C(0x0)
#define BMM350_DATA_Z_23_16_MSK                     UINT8_C(0xff)
#define BMM350_DATA_Z_23_16_POS                     UINT8_C(0x0)
#define BMM350_DATA_T_7_0_MSK                       UINT8_C(0xff)
#define BMM350_DATA_T_7_0_POS                       UINT8_C(0x0)
#define BMM350_DATA_T_15_8_MSK                      UINT8_C(0xff)
#define BMM350_DATA_T_15_8_POS                      UINT8_C(0x0)
#define BMM350_DATA_T_23_16_MSK                     UINT8_C(0xff)
#define BMM350_DATA_T_23_16_POS                     UINT8_C(0x0)
#define BMM350_DATA_ST_7_0_MSK                      UINT8_C(0xff)
#define BMM350_DATA_ST_7_0_POS                      UINT8_C(0x0)
#define BMM350_DATA_ST_15_8_MSK                     UINT8_C(0xff)
#define BMM350_DATA_ST_15_8_POS                     UINT8_C(0x0)
#define BMM350_DATA_ST_23_16_MSK                    UINT8_C(0xff)
#define BMM350_DATA_ST_23_16_POS                    UINT8_C(0x0)
#define BMM350_SIGN_INVERT_T_MSK                    UINT8_C(0x10)
#define BMM350_SIGN_INVERT_T_POS                    UINT8_C(0x4)
#define BMM350_SIGN_INVERT_X_MSK                    UINT8_C(0x20)
#define BMM350_SIGN_INVERT_X_POS                    UINT8_C(0x5)
#define BMM350_SIGN_INVERT_Y_MSK                    UINT8_C(0x40)
#define BMM350_SIGN_INVERT_Y_POS                    UINT8_C(0x6)
#define BMM350_SIGN_INVERT_Z_MSK                    UINT8_C(0x80)
#define BMM350_SIGN_INVERT_Z_POS                    UINT8_C(0x7)
#define BMM350_DIS_BR_NM_MSK                        UINT8_C(0x1)
#define BMM350_DIS_BR_NM_POS                        UINT8_C(0x0)
#define BMM350_DIS_FGR_NM_MSK                       UINT8_C(0x2)
#define BMM350_DIS_FGR_NM_POS                       UINT8_C(0x1)
#define BMM350_DIS_CRST_AT_ALL_MSK                  UINT8_C(0x4)
#define BMM350_DIS_CRST_AT_ALL_POS                  UINT8_C(0x2)
#define BMM350_DIS_BR_FM_MSK                        UINT8_C(0x8)
#define BMM350_DIS_BR_FM_POS                        UINT8_C(0x3)
#define BMM350_FRC_EN_BUFF_MSK                      UINT8_C(0x1)
#define BMM350_FRC_EN_BUFF_POS                      UINT8_C(0x0)
#define BMM350_FRC_INA_EN1_MSK                      UINT8_C(0x2)
#define BMM350_FRC_INA_EN1_POS                      UINT8_C(0x1)
#define BMM350_FRC_INA_EN2_MSK                      UINT8_C(0x4)
#define BMM350_FRC_INA_EN2_POS                      UINT8_C(0x2)
#define BMM350_FRC_ADC_EN_MSK                       UINT8_C(0x8)
#define BMM350_FRC_ADC_EN_POS                       UINT8_C(0x3)
#define BMM350_FRC_INA_RST_MSK                      UINT8_C(0x10)
#define BMM350_FRC_INA_RST_POS                      UINT8_C(0x4)
#define BMM350_FRC_ADC_RST_MSK                      UINT8_C(0x20)
#define BMM350_FRC_ADC_RST_POS                      UINT8_C(0x5)
#define BMM350_FRC_INA_XSEL_MSK                     UINT8_C(0x1)
#define BMM350_FRC_INA_XSEL_POS                     UINT8_C(0x0)
#define BMM350_FRC_INA_YSEL_MSK                     UINT8_C(0x2)
#define BMM350_FRC_INA_YSEL_POS                     UINT8_C(0x1)
#define BMM350_FRC_INA_ZSEL_MSK                     UINT8_C(0x4)
#define BMM350_FRC_INA_ZSEL_POS                     UINT8_C(0x2)
#define BMM350_FRC_ADC_TEMP_EN_MSK                  UINT8_C(0x8)
#define BMM350_FRC_ADC_TEMP_EN_POS                  UINT8_C(0x3)
#define BMM350_FRC_TSENS_EN_MSK                     UINT8_C(0x10)
#define BMM350_FRC_TSENS_EN_POS                     UINT8_C(0x4)
#define BMM350_DSENS_FM_MSK                         UINT8_C(0x20)
#define BMM350_DSENS_FM_POS                         UINT8_C(0x5)
#define BMM350_DSENS_SEL_MSK                        UINT8_C(0x40)
#define BMM350_DSENS_SEL_POS                        UINT8_C(0x6)
#define BMM350_DSENS_SHORT_MSK                      UINT8_C(0x80)
#define BMM350_DSENS_SHORT_POS                      UINT8_C(0x7)
#define BMM350_ERR_MISS_BR_DONE_MSK                 UINT8_C(0x1)
#define BMM350_ERR_MISS_BR_DONE_POS                 UINT8_C(0x0)
#define BMM350_ERR_MISS_FGR_DONE_MSK                UINT8_C(0x2)
#define BMM350_ERR_MISS_FGR_DONE_POS                UINT8_C(0x1)
#define BMM350_TST_CHAIN_LN_MODE_MSK                UINT8_C(0x1)
#define BMM350_TST_CHAIN_LN_MODE_POS                UINT8_C(0x0)
#define BMM350_TST_CHAIN_LP_MODE_MSK                UINT8_C(0x2)
#define BMM350_TST_CHAIN_LP_MODE_POS                UINT8_C(0x1)
#define BMM350_EN_OVWR_TMR_IF_MSK                   UINT8_C(0x1)
#define BMM350_EN_OVWR_TMR_IF_POS                   UINT8_C(0x0)
#define BMM350_TMR_CKTRIGB_MSK                      UINT8_C(0x2)
#define BMM350_TMR_CKTRIGB_POS                      UINT8_C(0x1)
#define BMM350_TMR_DO_BR_MSK                        UINT8_C(0x4)
#define BMM350_TMR_DO_BR_POS                        UINT8_C(0x2)
#define BMM350_TMR_DO_FGR_MSK                       UINT8_C(0x18)
#define BMM350_TMR_DO_FGR_POS                       UINT8_C(0x3)
#define BMM350_TMR_EN_OSC_MSK                       UINT8_C(0x80)
#define BMM350_TMR_EN_OSC_POS                       UINT8_C(0x7)
#define BMM350_VCM_TRIM_X_MSK                       UINT8_C(0x1f)
#define BMM350_VCM_TRIM_X_POS                       UINT8_C(0x0)
#define BMM350_VCM_TRIM_Y_MSK                       UINT8_C(0x1f)
#define BMM350_VCM_TRIM_Y_POS                       UINT8_C(0x0)
#define BMM350_VCM_TRIM_Z_MSK                       UINT8_C(0x1f)
#define BMM350_VCM_TRIM_Z_POS                       UINT8_C(0x0)
#define BMM350_VCM_TRIM_DSENS_MSK                   UINT8_C(0x1f)
#define BMM350_VCM_TRIM_DSENS_POS                   UINT8_C(0x0)
#define BMM350_TWLB_MSK                             UINT8_C(0x30)
#define BMM350_TWLB_POS                             UINT8_C(0x4)
#define BMM350_PRG_PLS_TIM_MSK                      UINT8_C(0x30)
#define BMM350_PRG_PLS_TIM_POS                      UINT8_C(0x4)
#define BMM350_OTP_OVWR_EN_MSK                      UINT8_C(0x1)
#define BMM350_OTP_OVWR_EN_POS                      UINT8_C(0x0)
#define BMM350_OTP_MEM_CLK_MSK                      UINT8_C(0x2)
#define BMM350_OTP_MEM_CLK_POS                      UINT8_C(0x1)
#define BMM350_OTP_MEM_CS_MSK                       UINT8_C(0x4)
#define BMM350_OTP_MEM_CS_POS                       UINT8_C(0x2)
#define BMM350_OTP_MEM_PGM_MSK                      UINT8_C(0x8)
#define BMM350_OTP_MEM_PGM_POS                      UINT8_C(0x3)
#define BMM350_OTP_MEM_RE_MSK                       UINT8_C(0x10)
#define BMM350_OTP_MEM_RE_POS                       UINT8_C(0x4)
#define BMM350_SAMPLE_RDATA_PLS_MSK                 UINT8_C(0x80)
#define BMM350_SAMPLE_RDATA_PLS_POS                 UINT8_C(0x7)
#define BMM350_CFG_FW_MSK                           UINT8_C(0x1)
#define BMM350_CFG_FW_POS                           UINT8_C(0x0)
#define BMM350_EN_BR_X_MSK                          UINT8_C(0x2)
#define BMM350_EN_BR_X_POS                          UINT8_C(0x1)
#define BMM350_EN_BR_Y_MSK                          UINT8_C(0x4)
#define BMM350_EN_BR_Y_POS                          UINT8_C(0x2)
#define BMM350_EN_BR_Z_MSK                          UINT8_C(0x8)
#define BMM350_EN_BR_Z_POS                          UINT8_C(0x3)
#define BMM350_CFG_PAUSE_TIME_MSK                   UINT8_C(0x30)
#define BMM350_CFG_PAUSE_TIME_POS                   UINT8_C(0x4)
#define BMM350_CFG_FGR_PLS_DUR_MSK                  UINT8_C(0xf)
#define BMM350_CFG_FGR_PLS_DUR_POS                  UINT8_C(0x0)
#define BMM350_CFG_BR_Z_ORDER_MSK                   UINT8_C(0x10)
#define BMM350_CFG_BR_Z_ORDER_POS                   UINT8_C(0x4)
#define BMM350_CFG_BR_XY_CHOP_MSK                   UINT8_C(0x20)
#define BMM350_CFG_BR_XY_CHOP_POS                   UINT8_C(0x5)
#define BMM350_CFG_BR_PLS_DUR_MSK                   UINT8_C(0xc0)
#define BMM350_CFG_BR_PLS_DUR_POS                   UINT8_C(0x6)
#define BMM350_ENABLE_BR_FGR_TEST_MSK               UINT8_C(0x1)
#define BMM350_ENABLE_BR_FGR_TEST_POS               UINT8_C(0x0)
#define BMM350_SEL_AXIS_MSK                         UINT8_C(0xe)
#define BMM350_SEL_AXIS_POS                         UINT8_C(0x1)
#define BMM350_TMR_CFG_TEST_CLK_EN_MSK              UINT8_C(0x10)
#define BMM350_TMR_CFG_TEST_CLK_EN_POS              UINT8_C(0x4)
#define BMM350_TEST_VAL_BITS_7DOWNTO0_MSK           UINT8_C(0xff)
#define BMM350_TEST_VAL_BITS_7DOWNTO0_POS           UINT8_C(0x0)
#define BMM350_TEST_VAL_BITS_8_MSK                  UINT8_C(0x1)
#define BMM350_TEST_VAL_BITS_8_POS                  UINT8_C(0x0)
#define BMM350_TEST_P_SAMPLE_MSK                    UINT8_C(0x2)
#define BMM350_TEST_P_SAMPLE_POS                    UINT8_C(0x1)
#define BMM350_TEST_N_SAMPLE_MSK                    UINT8_C(0x4)
#define BMM350_TEST_N_SAMPLE_POS                    UINT8_C(0x2)
#define BMM350_TEST_APPLY_TO_REM_MSK                UINT8_C(0x10)
#define BMM350_TEST_APPLY_TO_REM_POS                UINT8_C(0x4)
#define BMM350_UFO_TRM_OSC_RANGE_MSK                UINT8_C(0xf)
#define BMM350_UFO_TRM_OSC_RANGE_POS                UINT8_C(0x0)
#define BMM350_ISO_CHIP_ID_MSK                      UINT8_C(0x78)
#define BMM350_ISO_CHIP_ID_POS                      UINT8_C(0x3)
#define BMM350_ISO_I2C_DEV_ID_MSK                   UINT8_C(0x80)
#define BMM350_ISO_I2C_DEV_ID_POS                   UINT8_C(0x7)
#define BMM350_I3C_FREQ_BITS_1DOWNTO0_MSK           UINT8_C(0xc)
#define BMM350_I3C_FREQ_BITS_1DOWNTO0_POS           UINT8_C(0x2)
#define BMM350_I3C_IBI_MDB_SEL_MSK                  UINT8_C(0x10)
#define BMM350_I3C_IBI_MDB_SEL_POS                  UINT8_C(0x4)
#define BMM350_TC_ASYNC_EN_MSK                      UINT8_C(0x20)
#define BMM350_TC_ASYNC_EN_POS                      UINT8_C(0x5)
#define BMM350_TC_SYNC_EN_MSK                       UINT8_C(0x40)
#define BMM350_TC_SYNC_EN_POS                       UINT8_C(0x6)
#define BMM350_I3C_SCL_GATING_EN_MSK                UINT8_C(0x80)
#define BMM350_I3C_SCL_GATING_EN_POS                UINT8_C(0x7)
#define BMM350_I3C_INACCURACY_BITS_6DOWNTO0_MSK     UINT8_C(0x7f)
#define BMM350_I3C_INACCURACY_BITS_6DOWNTO0_POS     UINT8_C(0x0)
#define BMM350_EST_EN_X_MSK                         UINT8_C(0x1)
#define BMM350_EST_EN_X_POS                         UINT8_C(0x0)
#define BMM350_EST_EN_Y_MSK                         UINT8_C(0x2)
#define BMM350_EST_EN_Y_POS                         UINT8_C(0x1)
#define BMM350_CRST_DIS_MSK                         UINT8_C(0x4)
#define BMM350_CRST_DIS_POS                         UINT8_C(0x2)
#define BMM350_BR_TFALL_MSK                         UINT8_C(0x7)
#define BMM350_BR_TFALL_POS                         UINT8_C(0x0)
#define BMM350_BR_TRISE_MSK                         UINT8_C(0x70)
#define BMM350_BR_TRISE_POS                         UINT8_C(0x4)
#define BMM350_TMR_SOFT_START_DIS_MSK               UINT8_C(0x80)
#define BMM350_TMR_SOFT_START_DIS_POS               UINT8_C(0x7)
#define BMM350_FOSC_LOW_RANGE_MSK                   UINT8_C(0x80)
#define BMM350_FOSC_LOW_RANGE_POS                   UINT8_C(0x7)
#define BMM350_VCRST_TRIM_FG_MSK                    UINT8_C(0x3f)
#define BMM350_VCRST_TRIM_FG_POS                    UINT8_C(0x0)
#define BMM350_VCRST_TRIM_BR_MSK                    UINT8_C(0x3f)
#define BMM350_VCRST_TRIM_BR_POS                    UINT8_C(0x0)
#define BMM350_BG_TRIM_VRP_MSK                      UINT8_C(0xc0)
#define BMM350_BG_TRIM_VRP_POS                      UINT8_C(0x6)
#define BMM350_BG_TRIM_TC_MSK                       UINT8_C(0xf)
#define BMM350_BG_TRIM_TC_POS                       UINT8_C(0x0)
#define BMM350_BG_TRIM_VRA_MSK                      UINT8_C(0xf0)
#define BMM350_BG_TRIM_VRA_POS                      UINT8_C(0x4)
#define BMM350_BG_TRIM_VRD_MSK                      UINT8_C(0xf)
#define BMM350_BG_TRIM_VRD_POS                      UINT8_C(0x0)
#define BMM350_OVWR_REF_IB_EN_MSK                   UINT8_C(0x10)
#define BMM350_OVWR_REF_IB_EN_POS                   UINT8_C(0x4)
#define BMM350_OVWR_VDDA_EN_MSK                     UINT8_C(0x20)
#define BMM350_OVWR_VDDA_EN_POS                     UINT8_C(0x5)
#define BMM350_OVWR_VDDP_EN_MSK                     UINT8_C(0x40)
#define BMM350_OVWR_VDDP_EN_POS                     UINT8_C(0x6)
#define BMM350_OVWR_VDDS_EN_MSK                     UINT8_C(0x80)
#define BMM350_OVWR_VDDS_EN_POS                     UINT8_C(0x7)
#define BMM350_REF_IB_EN_MSK                        UINT8_C(0x10)
#define BMM350_REF_IB_EN_POS                        UINT8_C(0x4)
#define BMM350_VDDA_EN_MSK                          UINT8_C(0x20)
#define BMM350_VDDA_EN_POS                          UINT8_C(0x5)
#define BMM350_VDDP_EN_MSK                          UINT8_C(0x40)
#define BMM350_VDDP_EN_POS                          UINT8_C(0x6)
#define BMM350_VDDS_EN_MSK                          UINT8_C(0x80)
#define BMM350_VDDS_EN_POS                          UINT8_C(0x7)
#define BMM350_OVWR_OTP_PROG_VDD_SW_EN_MSK          UINT8_C(0x8)
#define BMM350_OVWR_OTP_PROG_VDD_SW_EN_POS          UINT8_C(0x3)
#define BMM350_OVWR_EN_MFE_BG_FILT_BYPASS_MSK       UINT8_C(0x10)
#define BMM350_OVWR_EN_MFE_BG_FILT_BYPASS_POS       UINT8_C(0x4)
#define BMM350_OTP_PROG_VDD_SW_EN_MSK               UINT8_C(0x8)
#define BMM350_OTP_PROG_VDD_SW_EN_POS               UINT8_C(0x3)
#define BMM350_CP_COMP_CRST_EN_TM_MSK               UINT8_C(0x10)
#define BMM350_CP_COMP_CRST_EN_TM_POS               UINT8_C(0x4)
#define BMM350_CP_COMP_VDD_EN_TM_MSK                UINT8_C(0x20)
#define BMM350_CP_COMP_VDD_EN_TM_POS                UINT8_C(0x5)
#define BMM350_CP_INTREFS_EN_TM_MSK                 UINT8_C(0x40)
#define BMM350_CP_INTREFS_EN_TM_POS                 UINT8_C(0x6)
#define BMM350_ADC_LOCAL_CHOP_EN_MSK                UINT8_C(0x20)
#define BMM350_ADC_LOCAL_CHOP_EN_POS                UINT8_C(0x5)
#define BMM350_INA_MODE_MSK                         UINT8_C(0x40)
#define BMM350_INA_MODE_POS                         UINT8_C(0x6)
#define BMM350_VDDD_EXT_EN_MSK                      UINT8_C(0x20)
#define BMM350_VDDD_EXT_EN_POS                      UINT8_C(0x5)
#define BMM350_VDDP_EXT_EN_MSK                      UINT8_C(0x80)
#define BMM350_VDDP_EXT_EN_POS                      UINT8_C(0x7)
#define BMM350_ADC_DSENS_EN_MSK                     UINT8_C(0x10)
#define BMM350_ADC_DSENS_EN_POS                     UINT8_C(0x4)
#define BMM350_DSENS_EN_MSK                         UINT8_C(0x20)
#define BMM350_DSENS_EN_POS                         UINT8_C(0x5)
#define BMM350_OTP_TM_CLVWR_EN_MSK                  UINT8_C(0x40)
#define BMM350_OTP_TM_CLVWR_EN_POS                  UINT8_C(0x6)
#define BMM350_OTP_VDDP_DIS_MSK                     UINT8_C(0x80)
#define BMM350_OTP_VDDP_DIS_POS                     UINT8_C(0x7)
#define BMM350_FORCE_HIGH_VREF_IREF_OK_MSK          UINT8_C(0x10)
#define BMM350_FORCE_HIGH_VREF_IREF_OK_POS          UINT8_C(0x4)
#define BMM350_FORCE_HIGH_FOSC_OK_MSK               UINT8_C(0x20)
#define BMM350_FORCE_HIGH_FOSC_OK_POS               UINT8_C(0x5)
#define BMM350_FORCE_HIGH_MFE_BG_RDY_MSK            UINT8_C(0x40)
#define BMM350_FORCE_HIGH_MFE_BG_RDY_POS            UINT8_C(0x6)
#define BMM350_FORCE_HIGH_MFE_VTMR_RDY_MSK          UINT8_C(0x80)
#define BMM350_FORCE_HIGH_MFE_VTMR_RDY_POS          UINT8_C(0x7)
#define BMM350_ERR_END_OF_RECHARGE_MSK              UINT8_C(0x1)
#define BMM350_ERR_END_OF_RECHARGE_POS              UINT8_C(0x0)
#define BMM350_ERR_END_OF_DISCHARGE_MSK             UINT8_C(0x2)
#define BMM350_ERR_END_OF_DISCHARGE_POS             UINT8_C(0x1)
#define BMM350_CP_TMX_DIGTP_SEL_MSK                 UINT8_C(0x7)
#define BMM350_CP_TMX_DIGTP_SEL_POS                 UINT8_C(0x0)
#define BMM350_CP_CPOSC_EN_TM_MSK                   UINT8_C(0x80)
#define BMM350_CP_CPOSC_EN_TM_POS                   UINT8_C(0x7)
#define BMM350_TST_ATM1_CFG_MSK                     UINT8_C(0x3f)
#define BMM350_TST_ATM1_CFG_POS                     UINT8_C(0x0)
#define BMM350_TST_TB1_EN_MSK                       UINT8_C(0x80)
#define BMM350_TST_TB1_EN_POS                       UINT8_C(0x7)
#define BMM350_TST_ATM2_CFG_MSK                     UINT8_C(0x1f)
#define BMM350_TST_ATM2_CFG_POS                     UINT8_C(0x0)
#define BMM350_TST_TB2_EN_MSK                       UINT8_C(0x80)
#define BMM350_TST_TB2_EN_POS                       UINT8_C(0x7)
#define BMM350_REG_DTB1X_SEL_MSK                    UINT8_C(0x7f)
#define BMM350_REG_DTB1X_SEL_POS                    UINT8_C(0x0)
#define BMM350_SEL_DTB1X_PAD_MSK                    UINT8_C(0x80)
#define BMM350_SEL_DTB1X_PAD_POS                    UINT8_C(0x7)
#define BMM350_REG_DTB2X_SEL_MSK                    UINT8_C(0x7f)
#define BMM350_REG_DTB2X_SEL_POS                    UINT8_C(0x0)
#define BMM350_TMR_TST_CFG_MSK                      UINT8_C(0x7f)
#define BMM350_TMR_TST_CFG_POS                      UINT8_C(0x0)
#define BMM350_TMR_TST_HIZ_VTMR_MSK                 UINT8_C(0x80)
