wjk5117/BMM350-I3C-ESP32P4-Bringup/bmm350_defs.h
#define BMM350_TMR_TST_HIZ_VTMR_POS                 UINT8_C(0x7)

/****************************** OTP MACROS ***************************/
#define BMM350_OTP_CMD_DIR_READ                     UINT8_C(0x20)
#define BMM350_OTP_CMD_DIR_PRGM_1B                  UINT8_C(0x40)
#define BMM350_OTP_CMD_DIR_PRGM                     UINT8_C(0x60)
#define BMM350_OTP_CMD_PWR_OFF_OTP                  UINT8_C(0x80)
#define BMM350_OTP_CMD_EXT_READ                     UINT8_C(0xA0)
#define BMM350_OTP_CMD_EXT_PRGM                     UINT8_C(0xE0)
#define BMM350_OTP_CMD_MSK                          UINT8_C(0xE0)
#define BMM350_OTP_WORD_ADDR_MSK                    UINT8_C(0x1F)

#define BMM350_OTP_STATUS_ERROR_MSK                 UINT8_C(0xE0)
#define BMM350_OTP_STATUS_ERROR(val)                (val & BMM350_OTP_STATUS_ERROR_MSK)
#define BMM350_OTP_STATUS_NO_ERROR                  UINT8_C(0x00)
#define BMM350_OTP_STATUS_BOOT_ERR                  UINT8_C(0x20)
#define BMM350_OTP_STATUS_PAGE_RD_ERR               UINT8_C(0x40)
#define BMM350_OTP_STATUS_PAGE_PRG_ERR              UINT8_C(0x60)
#define BMM350_OTP_STATUS_SIGN_ERR                  UINT8_C(0x80)
#define BMM350_OTP_STATUS_INV_CMD_ERR               UINT8_C(0xA0)
#define BMM350_OTP_STATUS_CMD_DONE                  UINT8_C(0x01)

/****************************** OTP indices ***************************/
#define BMM350_TEMP_OFF_SENS                        UINT8_C(0x0D)

#define BMM350_MAG_OFFSET_X                         UINT8_C(0x0E)
#define BMM350_MAG_OFFSET_Y                         UINT8_C(0x0F)
#define BMM350_MAG_OFFSET_Z                         UINT8_C(0x10)

#define BMM350_MAG_SENS_X                           UINT8_C(0x10)
#define BMM350_MAG_SENS_Y                           UINT8_C(0x11)
#define BMM350_MAG_SENS_Z                           UINT8_C(0x11)

#define BMM350_MAG_TCO_X                            UINT8_C(0x12)
#define BMM350_MAG_TCO_Y                            UINT8_C(0x13)
#define BMM350_MAG_TCO_Z                            UINT8_C(0x14)

#define BMM350_MAG_TCS_X                            UINT8_C(0x12)
#define BMM350_MAG_TCS_Y                            UINT8_C(0x13)
#define BMM350_MAG_TCS_Z                            UINT8_C(0x14)

#define BMM350_MAG_DUT_T_0                          UINT8_C(0x18)

#define BMM350_CROSS_X_Y                            UINT8_C(0x15)
#define BMM350_CROSS_Y_X                            UINT8_C(0x15)
#define BMM350_CROSS_Z_X                            UINT8_C(0x16)
#define BMM350_CROSS_Z_Y                            UINT8_C(0x16)

#define BMM350_SENS_CORR_Y                          (0.01f)
#define BMM350_TCS_CORR_Z                           (0.0001f)

/**************************** Signed bit macros **********************/
#define BMM350_SIGNED_8_BIT                         UINT8_C(8)
#define BMM350_SIGNED_12_BIT                        UINT8_C(12)
#define BMM350_SIGNED_16_BIT                        UINT8_C(16)
#define BMM350_SIGNED_21_BIT                        UINT8_C(21)
#define BMM350_SIGNED_24_BIT                        UINT8_C(24)

/**************************** Self-test macros **********************/
#define BMM350_SELF_TEST_DISABLE                    UINT8_C(0x00)
#define BMM350_SELF_TEST_POS_X                      UINT8_C(0x0D)
#define BMM350_SELF_TEST_NEG_X                      UINT8_C(0x0B)
#define BMM350_SELF_TEST_POS_Y                      UINT8_C(0x15)
#define BMM350_SELF_TEST_NEG_Y                      UINT8_C(0x13)

#define BMM350_X_FM_XP_UST_MAX_LIMIT                INT16_C(150)
#define BMM350_X_FM_XP_UST_MIN_LIMIT                INT16_C(50)

#define BMM350_X_FM_XN_UST_MAX_LIMIT                INT16_C(-50)
#define BMM350_X_FM_XN_UST_MIN_LIMIT                INT16_C(-150)

#define BMM350_Y_FM_YP_UST_MAX_LIMIT                INT16_C(150)
#define BMM350_Y_FM_YP_UST_MIN_LIMIT                INT16_C(50)

#define BMM350_Y_FM_YN_UST_MAX_LIMIT                INT16_C(-50)
#define BMM350_Y_FM_YN_UST_MIN_LIMIT                INT16_C(-150)

/**************************** PMU command status 0 macros **********************/
#define BMM350_PMU_CMD_STATUS_0_SUS                 UINT8_C(0x00)
#define BMM350_PMU_CMD_STATUS_0_NM                  UINT8_C(0x01)
#define BMM350_PMU_CMD_STATUS_0_UPD_OAE             UINT8_C(0x02)
#define BMM350_PMU_CMD_STATUS_0_FM                  UINT8_C(0x03)
#define BMM350_PMU_CMD_STATUS_0_FM_FAST             UINT8_C(0x04)
#define BMM350_PMU_CMD_STATUS_0_FGR                 UINT8_C(0x05)
#define BMM350_PMU_CMD_STATUS_0_FGR_FAST            UINT8_C(0x06)
#define BMM350_PMU_CMD_STATUS_0_BR                  UINT8_C(0x07)
#define BMM350_PMU_CMD_STATUS_0_BR_FAST             UINT8_C(0x07)


/**************************** PRESET MODE DEFINITIONS **********************/   
#define BMM350_PRESETMODE_LOWPOWER                UINT8_C(0x01)
#define BMM350_PRESETMODE_REGULAR                 UINT8_C(0x02)
#define BMM350_PRESETMODE_HIGHACCURACY            UINT8_C(0x03)
#define BMM350_PRESETMODE_ENHANCED                UINT8_C(0x04)

#define LOW_THRESHOLD_INTERRUPT          0
#define HIGH_THRESHOLD_INTERRUPT         1
#define INTERRUPT_X_ENABLE               0
#define INTERRUPT_Y_ENABLE               0
#define INTERRUPT_Z_ENABLE               0
#define INTERRUPT_X_DISABLE              1
#define INTERRUPT_Y_DISABLE              1
#define INTERRUPT_Z_DISABLE              1
#define ENABLE_INTERRUPT_PIN             1
#define DISABLE_INTERRUPT_PIN            0
#define NO_DATA                          -32768

#define I2C_ADDRESS                     0x14

/****************************** Enumerators ***************************/
enum eBmm350InterruptEnableDisable_t {
    BMM350_DISABLE_INTERRUPT = BMM350_DISABLE,
    BMM350_ENABLE_INTERRUPT = BMM350_ENABLE
};

enum eBmm350PowerModes_t {
    eBmm350SuspendMode = BMM350_PMU_CMD_SUS,
    eBmm350NormalMode = BMM350_PMU_CMD_NM,
    eBmm350ForcedMode = BMM350_PMU_CMD_FM,
    eBmm350ForcedModeFast = BMM350_PMU_CMD_FM_FAST
};

enum eBmm350DataRates_t {
    BMM350_DATA_RATE_400HZ    = BMM350_ODR_400HZ,
    BMM350_DATA_RATE_200HZ    = BMM350_ODR_200HZ,
    BMM350_DATA_RATE_100HZ    = BMM350_ODR_100HZ,
    BMM350_DATA_RATE_50HZ     = BMM350_ODR_50HZ,
    BMM350_DATA_RATE_25HZ     = BMM350_ODR_25HZ,
    BMM350_DATA_RATE_12_5HZ   = BMM350_ODR_12_5HZ,
    BMM350_DATA_RATE_6_25HZ   = BMM350_ODR_6_25HZ,
    BMM350_DATA_RATE_3_125HZ  = BMM350_ODR_3_125HZ,
    BMM350_DATA_RATE_1_5625HZ = BMM350_ODR_1_5625HZ
};

