wjk5117/BMM350-I3C-ESP32P4-Bringup/bmm350_defs.h
enum bmm350_magreset_type {
    BMM350_FLUXGUIDE_9MS = BMM350_PMU_CMD_FGR,
    BMM350_FLUXGUIDE_FAST = BMM350_PMU_CMD_FGR_FAST,
    BMM350_BITRESET_9MS = BMM350_PMU_CMD_BR,
    BMM350_BITRESET_FAST = BMM350_PMU_CMD_BR_FAST,
    BMM350_NOMAGRESET = UINT8_C(127)
};

enum bmm350_intr_en_dis {
    BMM350_INTR_DISABLE = BMM350_DISABLE,
    BMM350_INTR_ENABLE = BMM350_ENABLE
};

enum bmm350_intr_map {
    BMM350_UNMAP_FROM_PIN = BMM350_DISABLE,
    BMM350_MAP_TO_PIN = BMM350_ENABLE
};
enum bmm350_intr_latch {
    BMM350_PULSED = BMM350_INT_MODE_PULSED,
    BMM350_LATCHED = BMM350_INT_MODE_LATCHED
};

enum eBmm350IntrPolarity_t {
    BMM350_ACTIVE_LOW = BMM350_INT_POL_ACTIVE_LOW,
    BMM350_ACTIVE_HIGH = BMM350_INT_POL_ACTIVE_HIGH
};

enum bmm350_intr_drive {
    BMM350_INTR_OPEN_DRAIN = BMM350_INT_OD_OPENDRAIN,
    BMM350_INTR_PUSH_PULL = BMM350_INT_OD_PUSHPULL
};

enum bmm350_drdy_int_map_to_ibi {
    BMM350_IBI_DISABLE = BMM350_DISABLE,
    BMM350_IBI_ENABLE = BMM350_ENABLE
};

enum bmm350_clear_drdy_int_status_upon_ibi {
    BMM350_NOCLEAR_ON_IBI = BMM350_DISABLE,
    BMM350_CLEAR_ON_IBI = BMM350_ENABLE
};

enum bmm350_i2c_wdt_en {
    BMM350_I2C_WDT_DIS = BMM350_DISABLE,
    BMM350_I2C_WDT_EN = BMM350_ENABLE
};

enum bmm350_i2c_wdt_sel {
    BMM350_I2C_WDT_SEL_SHORT = BMM350_DISABLE,
    BMM350_I2C_WDT_SEL_LONG = BMM350_ENABLE
};

enum bmm350_performance_parameters {
    BMM350_NO_AVERAGING = BMM350_AVG_NO_AVG,
    BMM350_AVERAGING_2 = BMM350_AVG_2,
    BMM350_AVERAGING_4 = BMM350_AVG_4,
    BMM350_AVERAGING_8 = BMM350_AVG_8,
    /*lint -e849*/
    BMM350_ULTRALOWNOISE = BMM350_AVG_8,
    BMM350_LOWNOISE = BMM350_AVG_4,
    BMM350_REGULARPOWER = BMM350_AVG_2,
    BMM350_LOWPOWER = BMM350_AVG_NO_AVG
};

enum bmm350_st_igen_en {
    BMM350_ST_IGEN_DIS = BMM350_DISABLE,
    BMM350_ST_IGEN_EN = BMM350_ENABLE
};

enum bmm350_st_n {
    BMM350_ST_N_DIS = BMM350_DISABLE,
    BMM350_ST_N_EN = BMM350_ENABLE
};

enum bmm350_st_p {
    BMM350_ST_P_DIS = BMM350_DISABLE,
    BMM350_ST_P_EN = BMM350_ENABLE
};

enum bmm350_ist_en_x {
    BMM350_IST_X_DIS = BMM350_DISABLE,
    BMM350_IST_X_EN = BMM350_ENABLE
};

enum bmm350_ist_en_y {
    BMM350_IST_Y_DIS = BMM350_DISABLE,
    BMM350_IST_Y_EN = BMM350_ENABLE
};

enum bmm350_ctrl_user {
    BMM350_CFG_SENS_TIM_AON_DIS = BMM350_DISABLE,
    BMM350_CFG_SENS_TIM_AON_EN = BMM350_ENABLE
};

enum eBmm350XAxisEnDis_t {
    BMM350_X_DIS = BMM350_DISABLE,
    BMM350_X_EN = BMM350_ENABLE
};

enum eBmm350YAxisEnDis_t {
    BMM350_Y_DIS = BMM350_DISABLE,
    BMM350_Y_EN = BMM350_ENABLE
};

enum eBmm350ZAxisEnDis_t {
    BMM350_Z_DIS = BMM350_DISABLE,
    BMM350_Z_EN = BMM350_ENABLE
};

/******************************************************************************/
/*! @name           Function Pointers                             */
/******************************************************************************/

/*!
 * @brief Bus communication function pointer which should be mapped to
 * the platform specific read functions of the user
 *
 * @param[in] reg_addr       : Register address from which data is read.
 * @param[out] reg_data      : Pointer to data buffer where read data is stored.
 * @param[in] len            : Number of bytes of data to be read.
 * @param[in, out] intfPtr  : Void pointer that can enable the linking of descriptors
 *                             for interface related call backs.
 *
 * retval = 0 -> Success
 * retval < 0 -> Failure
 *
 */
typedef BMM350_INTF_RET_TYPE (*pBmm350ReadFptr_t)(uint8_t reg_addr, uint8_t *reg_data, uint32_t len, void *intfPtr);

/*!
 * @brief Bus communication function pointer which should be mapped to
 * the platform specific write functions of the user
 *
 * @param[in] reg_addr      : Register address to which the data is written.
 * @param[in] reg_data      : Pointer to data buffer in which data to be written
 *                            is stored.
 * @param[in] len           : Number of bytes of data to be written.
 * @param[in, out] intfPtr : Void pointer that can enable the linking of descriptors
 *                            for interface related call backs
 *
 * retval = 0 -> Success
 * retval < 0 -> Failure
 *
 */
typedef BMM350_INTF_RET_TYPE (*pBmm350WriteFptr_t)(uint8_t reg_addr, const uint8_t *reg_data, uint32_t len,
                                                    void *intfPtr);

/*!
 * @brief Delay function pointer which should be mapped to
 * delay function of the user
 *
 * @param[in] period              : Delay in microseconds.
 * @param[in, out] intfPtr       : Void pointer that can enable the linking of descriptors
 *                                  for interface related call backs
 *
 */
typedef void (*pBmm350DelayUsFptr_t)(uint32_t period, void *intfPtr);

/* Pre-declaration */
struct bmm350_dev;

/*!
 * @brief Function pointer for the magnetic reset and wait override
 *
 * @param[in]  dev              : Structure instance of bmm350_dev.
 * @return Result of API execution status
 *  @retval = 0 -> Success
 *  @retval < 0 -> Error
 */
typedef int8_t (*bmm350_mraw_override_t)(struct bmm350_dev *dev);

/*************************  STRUCTURE DEFINITIONS *************************/

/*!
 * @brief bmm350 un-compensated (raw) magnetometer data, signed integer
 */
struct bmm350_raw_mag_data
{
    /*! Raw mag X data */
    int32_t raw_xdata;

    /*! Raw mag Y data */
    int32_t raw_ydata;

    /*! Raw mag Z data */
    int32_t raw_zdata;

    /*! Raw mag temperature value */
    int32_t raw_data_t;
};

/*!
 * @brief bmm350 compensated magnetometer data and temperature data
 */
struct sBmm350MagTempData_t
{
    /*! Compensated mag X data */
    float x;

    /*! Compensated mag Y data */
    float y;

    /*! Compensated mag Z data */
    float z;

    /*! Temperature */
    float temperature;
};

/*!
 * @brief bmm350 magnetometer dut offset coefficient structure
 */
struct bmm350_dut_offset_coef
{
    /*! Temperature offset */
    float t_offs;

    /*! Offset x-axis */
    float offset_x;

    /*! Offset y-axis */
    float offset_y;

    /*! Offset z-axis */
    float offset_z;
};

/*!
 * @brief bmm350 magnetometer dut sensitivity coefficient structure
 */
struct bmm350_dut_sensit_coef
{
    /*! Temperature sensitivity */
    float t_sens;

    /*! Sensitivity x-axis */
    float sens_x;

    /*! Sensitivity y-axis */
    float sens_y;

    /*! Sensitivity z-axis */
    float sens_z;
};

/*!
 * @brief bmm350 magnetometer dut tco structure
 */
struct bmm350_dut_tco
{
    float tco_x;
    float tco_y;
    float tco_z;
};

/*!
 * @brief bmm350 magnetometer dut tcs structure
 */
struct bmm350_dut_tcs
{
    float tcs_x;
    float tcs_y;
    float tcs_z;
};

/*!
 * @brief bmm350 magnetometer cross axis compensation structure
 */
struct bmm350_cross_axis
{
    float cross_x_y;
    float cross_y_x;
    float cross_z_x;
    float cross_z_y;
};

/*!
 * @brief bmm350 magnetometer compensate structure
 */
struct bmm350_mag_compensate
{
    /*! Structure to store dut offset coefficient */
    struct bmm350_dut_offset_coef dut_offset_coef;

    /*! Structure to store dut sensitivity coefficient */
    struct bmm350_dut_sensit_coef dut_sensit_coef;

    /*! Structure to store dut tco */
    struct bmm350_dut_tco dut_tco;

    /*! Structure to store dut tcs */
    struct bmm350_dut_tcs dut_tcs;

    /*! Initialize T0_reading parameter */
    float dut_t0;

    /*! Structure to define cross axis compensation */
    struct bmm350_cross_axis cross_axis;
};

/*!
 * @brief bmm350 device structure
 */
struct bmm350_dev
{
    /*!
     * The interface pointer is used to enable the user
     * to link their interface descriptors for reference during the
     * implementation of the read and write interfaces to the
     * hardware.
     */
    void* intfPtr;

    /*! Chip Id of BMM350 */
    uint8_t chipId;

    /*! Bus read function pointer */
    pBmm350ReadFptr_t read;

    /*! Bus write function pointer */
    pBmm350WriteFptr_t write;

    /*! delay(in us) function pointer */
    pBmm350DelayUsFptr_t delayUs;

