wjk5117/BMM350-I3C-ESP32P4-Bringup/bmm350_defs.h
    /*! To store interface pointer error */
    BMM350_INTF_RET_TYPE intf_rslt;

    /*! Variable to store status of axes enabled */
    uint8_t axisEn;

    /*! Structure for mag compensate */
    struct bmm350_mag_compensate mag_comp;

    /*! Array to store OTP data */
    uint16_t otp_data[BMM350_OTP_DATA_LENGTH];

    /*! Variant ID */
    uint8_t var_id;

    /*! Magnetic reset and wait override */
    bmm350_mraw_override_t mraw_override;

    /*! power mode */
    uint8_t powerMode;
};

/*!
 * @brief bmm350 self-test structure
 */
struct sBmm350SelfTest_t
{
    /* Variable to store self-test data on x-axis */
    float out_ust_x;

    /* Variable to store self-test data on y-axis */
    float out_ust_y;
};

/*!
 * @brief bmm350 PMU command status 0 structure
 */
struct bmm350_pmu_cmd_status_0
{
    /*! The previous PMU CMD is still in processing */
    uint8_t pmu_cmd_busy;

    /*! The previous PMU_CMD_AGGR_SET.odr has been overwritten */
    uint8_t odr_ovwr;

    /*! The previous PMU_CMD_AGGR_SET.avg has been overwritten */
    uint8_t avr_ovwr;

    /*! The chip is in normal power mode */
    uint8_t pwr_mode_is_normal;

    /*! CMD value is not allowed */
    uint8_t cmd_is_illegal;

    /*! Stores the latest PMU_CMD code processed */
    uint8_t pmu_cmd_value;
};

/**
 * @brief bmm350 compensated magnetometer data in int16_t format
 */
typedef struct{
    int32_t x; /**< compensated mag X data */
    int32_t y; /**< compensated mag Y data */
    int32_t z; /**< compensated mag Z data */
    int32_t temperature; /**< compensated temperature data */
    float float_x;
    float float_y;
    float float_z;
    float float_temperature;
}sBmm350MagData_t;

typedef struct{
  int16_t mag_x;     /**< mag X data */
  int16_t mag_y;     /**< mag Y data */
  int16_t mag_z;     /**< mag Z data */
  uint8_t interrupt_x;  /**< X-axis interrupt trigger flag*/ 
  uint8_t interrupt_y;  /**< Y-axis interrupt trigger flag*/ 
  uint8_t interrupt_z;  /**< Z-axis interrupt trigger flag*/ 
}sBmm350ThresholdData_t;

#endif /* _BMM350_DEFS_H */
